app/controllers/users_controller.rb

INSERT INTO `users` (`single_access_token`, `last_request_at`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `last_login_at`, `email`) VALUES('ByvNi1Z7HQ8_H8QnhiT_', '2009-10-20 06:20:39', '2009-10-20 06:20:39', '3d5fc3cdf6a3a130b11875fed11c1ed8b3ee4be2210d06c57222aa94cc8117ce05b575124fc9fca64431b5b69039fe290d9a2b308bc25fc0812b7602b68ac2ea', '4C-Oe3_o9MAkUWRmv8QL', '2009-10-20 06:20:39', 0, '0.0.0.0', 'V2rkOLb1uY5Z4A81Ch6b', '2009-10-20 06:20:39', '3941c90b882d6a2e6b195399ae6712fae80234c954637295d347ce89b8defe382a944af23fabf09b1b5a49d3bc43fb24cba6c8149a17923dab69bc2d7205d7af', 1, NULL, NULL, 'greg@lesch.us')
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE `users` SET `updated_at` = '2009-10-20 06:20:39', `crypted_password` = '249ef2c4b70465ccacfe7d9b2ef73f789f506f32e3a477833d76fc12efcdfe00fa57da6353f03a5ebab5090f6f62f746b98be3c07a0dbe434bed026f68d39fe4', `perishable_token` = 'soAqnMBrMWe_l1CHGmxL', `email` = 'irving.adams@bosco.us', `current_login_at` = '2009-10-20 06:20:39', `password_salt` = 'vbISVmMQbDlvrZEZb54h', `login_count` = 3, `persistence_token` = '7d5f08a91e6c6333141c4fe8c6693f41721d1e4ce22723d567dcb778a2dad0b2ff52faea38e5e11bfb28621dc91ebbed9ee063b87b423bfdc3458a319d52a550', `last_request_at` = '2009-10-20 06:20:39' WHERE `id` = 8
---
  def update
    @user = @current_user # makes our views "cleaner" and more consistent
    if @user.update_attributes(params[:user])